## Plan Result (Aks_sbox)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 6 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_role_assignment.disk
* Update
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
* Replace
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-sbox-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff47ab8f-e4d9-48f2-ad31-af5933824849"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks"
      ~ kubernetes_version                  = "1.28.5" -> "1.28"
        name                                = "cft-sbox-00-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (30 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "system"
          ~ orchestrator_version         = "1.28.5" -> "1.28"
            tags                         = {
                "application"  = "core"
                "autoShutdown" = "true"
                "builtFrom"    = "hmcts/aks-cft-deploy"
                "businessArea" = "CFT"
                "criticality"  = "Low"
                "environment"  = "sandbox"
                "expiresAfter" = "3000-01-01"
            }
            # (22 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks/agentPools/cronjob"
        name                    = "cronjob"
      ~ orchestrator_version    = "1.28.5" -> "1.28"
        tags                    = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks/agentPools/linux"
        name                    = "linux"
      ~ orchestrator_version    = "1.28.5" -> "1.28"
        tags                    = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled = false -> null
      - enable_host_encryption  = false -> null
      - enable_node_public_ip   = false -> null
      - eviction_policy         = "Delete" -> null # forces replacement
      - fips_enabled            = false -> null
      ~ id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks/agentPools/spotinstance" -> (known after apply)
      ~ kubelet_disk_type       = "OS" -> (known after apply)
        name                    = "spotinstance"
      ~ node_count              = 1 -> (known after apply)
      ~ node_labels             = {
          - "kubernetes.azure.com/scalesetpriority" = "spot"
        } -> (known after apply)
      ~ orchestrator_version    = "1.28.5" -> "1.28"
      ~ os_disk_size_gb         = 128 -> (known after apply)
      ~ os_sku                  = "Ubuntu" -> (known after apply)
        tags                    = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks"
      ~ kubernetes_version                  = "1.28.5" -> "1.28"
        name                                = "cft-sbox-01-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (30 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "system"
          ~ orchestrator_version         = "1.28.5" -> "1.28"
            tags                         = {
                "application"  = "core"
                "autoShutdown" = "true"
                "builtFrom"    = "hmcts/aks-cft-deploy"
                "businessArea" = "CFT"
                "criticality"  = "Low"
                "environment"  = "sandbox"
                "expiresAfter" = "3000-01-01"
            }
            # (22 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks/agentPools/cronjob"
        name                    = "cronjob"
      ~ orchestrator_version    = "1.28.5" -> "1.28"
        tags                    = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks/agentPools/linux"
        name                    = "linux"
      ~ orchestrator_version    = "1.28.5" -> "1.28"
        tags                    = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled = false -> null
      - enable_host_encryption  = false -> null
      - enable_node_public_ip   = false -> null
      - eviction_policy         = "Delete" -> null # forces replacement
      - fips_enabled            = false -> null
      ~ id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks/agentPools/spotinstance" -> (known after apply)
      ~ kubelet_disk_type       = "OS" -> (known after apply)
        name                    = "spotinstance"
      ~ node_count              = 1 -> (known after apply)
      ~ node_labels             = {
          - "kubernetes.azure.com/scalesetpriority" = "spot"
        } -> (known after apply)
      ~ orchestrator_version    = "1.28.5" -> "1.28"
      ~ os_disk_size_gb         = 128 -> (known after apply)
      ~ os_sku                  = "Ubuntu" -> (known after apply)
        tags                    = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 6 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/disks-sbox-rg" -> null
        name     = "disks-sbox-rg"
        tags     = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":613,"Program":"tfcmt","SHA1":"","Target":"Aks_sbox","Vars":{}} -->